diplom-src/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейВПериоде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЗапланированоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПересчитатьДниВПериоде()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
		
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) И ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Тогда
	
		ТекущиеДанные.ДнейВПериоде = (НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала)) / (24*3600);
	  
	КонецЕсли; 
	
	ПересчитатьДниВГоду();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатьДниВГоду() 
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	ТекущиеДанные.ВсегоЗапланированоДней = 0;
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.Сотрудник = ТекущиеДанные.Сотрудник Тогда	
			ТекущиеДанные.ВсегоЗапланированоДней = ТекущиеДанные.ВсегоЗапланированоДней + Строка.ДнейВПериоде;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.Сотрудник = ТекущиеДанные.Сотрудник Тогда	
			Строка.ВсегоЗапланированоДней = ТекущиеДанные.ВсегоЗапланированоДней;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПересчитатьДниВПериоде();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПересчитатьДниВПериоде();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДнейВПериодеПриИзменении(Элемент)
	ПересчитатьДниВГоду(); 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
	
	ТаблицаОтпускаСотрудников = ПоместитьДанныеВыбора();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТаблицаОтпускаСотрудников", ТаблицаОтпускаСотрудников);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаСервере
Функция ПоместитьДанныеВыбора() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());	
	
КонецФункции
